Autodesk.Revit.DB.IFC.IFCAggregateIterator.CurrentObject
Gets the item at the current position of the iterator.(Inherited from IEnumerator. Give it another property name to avoid confusing. And make it internal.)

Autodesk.Revit.DB.IFC.IFCAggregateIterator.Current
Gets the item at the current position of the iterator.
Remarks: There is no current item if the iterator has not started yet or has been done.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:  There is no current item in the iterator.

Autodesk.Revit.DB.IFC.IFCAggregateIterator.GetCurrent
Returns the current IFCData.
Returns:
The current IFCData.
Since:
2013

Autodesk.Revit.DB.IFC.IFCAggregateIterator.Reset
Resets the iterator to the beginning of the aggregate.
Since:
2013

Autodesk.Revit.DB.IFC.IFCAggregateIterator.MoveNext
Increments the iterator to the next object in the IFCAggregate.
Returns:
True if there is another available object in this iterator.
False if the iterator has completed all available objects.
Since:
2013

Autodesk.Revit.DB.IFC.IFCAggregateIterator.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFC.IFCAggregateIterator
A class used to iterate individual objects in an IFCAggregate.
Since:
2013